Revit 2024 API
ExportLineweightTable.GetKeys Method
 Gets all the keys stored in the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IList<ExportLineweightKey> GetKeys()
Visual Basic
Public Function GetKeys As IList(Of ExportLineweightKey)
Visual C++
public:
IList<ExportLineweightKey^>^ GetKeys()
Return Value
 The keys.
See Also
ExportLineweightTable Class
Autodesk.Revit.DB Namespace